Repository: doron3199/Kaptchi
Catalog: lib/l10n/app_*.arb
Languages: he

source: Settings
he: הגדרות

source: Language
he: שפה

source: English
he: אנגלית

source: Hebrew
he: עברית

source: Available Cameras
he: מצלמות זמינות

source: No cameras found
he: לא נמצאו מצלמות

source: Export Settings
he: הגדרות ייצוא

source: File Name
he: שם הקובץ

source: Save Location
he: מיקום השמירה

# exportPdf
source: Export {count} Images to PDF
he: ייצא {count} תמונות ל-PDF

source: Connect Mobile Camera
he: חבר מצלמת טלפון

source: Server Interface:
he: ממשק שרת:

# scanWithApp
source: Scan with Kaptchi mobile app
he: סרוק עם אפליקציית Kaptchi

source: Stream disconnected
he: השידור התנתק

# permissionsRequired
source: Camera and Microphone permissions are required for streaming
he: נדרשות הרשאות מצלמה ומיקרופון לשידור

# failedToStartStream
source: Failed to start stream: {error}
he: הפעלת השידור נכשלה: {error}

# failedToResumeStream
source: Failed to resume stream: {error}
he: חידוש השידור נכשל: {error}

# rtmpNotSupported
source: RTMP not supported on this platform
he: RTMP אינו נתמך בפלטפורמה זו

# errorStartingCamera
source: Error starting camera: {error}
he: שגיאה בהפעלת המצלמה: {error}

# captureFrameError
source: Failed to capture frame
he: נכשל בלכידת הפריים

# boundaryNotFoundError
source: Failed to capture frame: boundary not found
he: נכשל בלכידת הפריים: גבול לא נמצא

# errorCapturingFrame
source: Error capturing frame: {error}
he: שגיאה בלכידת הפריים: {error}

source: Group Name
he: שם קבוצה

source: Select Filters:
he: בחר מסננים:

source: Delete
he: מחק

source: Cancel
he: ביטול

source: Save
he: שמור

source: All Filters
he: כל המסננים

source: Filter Groups
he: קבוצות מסננים

source: Edit Filter Group
he: ערוך קבוצת מסננים

source: Add Filter Group
he: הוסף קבוצת מסננים

# activeFiltersCount
source: {count} active filters
he: {count} מסננים פעילים

# dragToReorder
source: Drag to reorder. Top filters apply first.
he: גרור כדי לסדר מחדש. המסננים העליונים חלים קודם.

source: Captured Images
he: תמונות שנלכדו

source: No images captured
he: אין תמונות

source: Image {index}
he: תמונה {index}

source: Export to PDF
he: ייצא ל-PDF

# exportPdfButton
source: Export PDF
he: ייצא PDF

source: Close
he: סגור

source: Edit
he: ערוך

source: Crop
he: חתוך

source: Overlay
he: שכבה

# fullscreenExit
source: Exit Fullscreen
he: צא ממסך מלא

# transmissionTitle
source: Transmitting
he: משדר

source: Stop Transmission
he: עצור שידור

source: Camera Mode
he: מצב מצלמה

source: Open Filters
he: פתח מסננים

source: Close Filters
he: סגור מסננים

source: Back to Home
he: חזרה לבית

source: Open Gallery
he: פתח גלריה

source: Close Gallery
he: סגור גלריה

source: Switch Camera
he: החלף מצלמה

# lockZoom
source: Lock Zoom to Pan
he: נעל זום לגלילה

source: Unlock Zoom
he: שחרר זום

source: Quick Draw
he: ציור מהיר

source: Capture Frame
he: צלם תמונה

source: Try Next Camera
he: נסה מצלמה הבאה

# cameraFailed
source: Camera failed to initialize
he: המצלמה נכשלה באתחול

source: Scan QR Code
he: סרוק קוד QR

# unsavedImagesTitle
source: Unsaved Images
he: תמונות לא שמורות

# unsavedImagesMessage
source: You have images in your gallery that are not exported. They will be lost if you exit. Are you sure?
he: יש לך תמונות בגלריה שלא יוצאו. הן יאבדו אם תצא. האם אתה בטוח?

source: Exit
he: יציאה

# pdfSaved
source: Saved PDF to {path}
he: PDF נשמר בנתיב {path}

# pdfExportError
source: Error exporting PDF: {error}
he: שגיאה בייצוא PDF: {error}

source: Media Server Running
he: שרת מדיה פועל

source: Media Server Stopped
he: שרת מדיה כבוי

source: Edit Image
he: ערוך תמונה

source: Perspective
he: פרספקטיבה

source: Rectangular
he: מלבני

source: Crop Failed
he: חיתוך נכשל

# cropImageTitle
source: Crop Image
he: חתוך תמונה

source: Select Video Source
he: בחר מקור וידאו

source: Local Cameras
he: מצלמות מקומיות

source: Remote Streams
he: שידורים מרוחקים

source: Mobile App
he: אפליקציה ניידת

# connectViaQr
source: Connect via QR Code
he: התחבר באמצעות קוד QR

# filterShakingStabilization
source: Shaking Stabilization
he: ייצוב רעידות

# filterLightStabilization
source: Light Stabilization
he: ייצוב תאורה

# filterCornerSmoothing
source: Corner Smoothing
he: החלקת פינות

# filterSharpening
source: Sharpening
he: חידוד

# filterContrastBoost
source: Contrast Boost (CLAHE)
he: הגברת ניגודיות (CLAHE)

# filterMovingAverage
source: Moving Average
he: ממוצע נע

# filterSmartObstacleRemoval
source: Smart Obstacle Removal
he: הסרת מכשולים חכמה

# filterSmartWhiteboard
source: Smart Whiteboard
he: לוח לבן חכם

# filterPersonRemoval
source: Person Removal (AI)
he: הסרת אנשים (AI)

# filterBlurLegacy
source: Blur (Legacy)
he: טשטוש (ישן)

# filterInvertColors
source: Invert Colors
he: היפוך צבעים

# filterWhiteboardLegacy
source: Whiteboard (Legacy)
he: לוח לבן (ישן)

# filterThresholdSensitivity
source: Threshold:
he: רגישות:

# filterGroupStabilizers
source: Stabilizers
he: מייצבים

source: Mobile Connect
he: חבר מצלמת טלפון

# filterGroupWhiteboard
source: Whiteboard
he: לוח לבן

source: About Kaptchi
he: אודות Kaptchi

source: What is Kaptchi?
he: מה זה Kaptchi?

# whatIsKaptchiDescription
source: Kaptchi is specifically designed to help visually impaired students see the whiteboard better. It transforms your setup into a personal vision aid with high-contrast filters, stabilization, and magnification, ensuring you never miss a detail in class.
he: Kaptchi נוצרה במיוחד כדי לעזור לסטודנטים לקויי ראייה לראות את הלוח טוב יותר. היא הופכת את המחשב שלך לעזר ראייה אישי עם מסננים חכמים לשיפור ניגודיות, ייצוב והגדלה, כדי שלא תפספס אף פרט בשיעור.

source: Single Monitor Tip
he: טיפ למסך יחיד

# singleMonitorTipDescription
source: If you only have one monitor and want to capture a specific window (like Zoom or Google Meet) without obstruction, we recommend installing the "Virtual-Display-Driver" from GitHub to create a virtual second screen.
he: אם יש לך רק מסך אחד ואתה רוצה לצלם חלון מסוים (כמו זום או גוגל מיט) בלי שהחלון יסתיר לך, אנחנו ממליצים להתקין את "Virtual-Display-Driver" מ-GitHub כדי ליצור מסך שני וירטואלי.

source: Get Virtual Display Driver
he: הורד דרייבר למסך וירטואלי

source: Multi-Source Capable
he: תמיכה במקורות מרובים

# multiSourceDescription
source: Switch instantly between multiple cameras and screen capture sources.
he: החלף באופן מיידי בין מצלמות מרובות ולכידת מסך.

source: Smart Filters
he: מסננים חכמים

# smartFiltersDescription
source: Enhance legibility with "Whiteboard", "Stabilization", and "Sharpening" filters.
he: שפר את קריאות הטקסט עם מסנני "לוח לבן", "ייצוב" ו"חידוד".

# pdfExportDescription
source: Capture snapshots to your gallery and export them directly as a PDF document.
he: צלם תמונות לגלריה וייצא אותן ישירות לקובץ PDF.

# mobileConnectDescription
source: Use your phone as an external camera via the QR code connection.
he: השתמש בטלפון כמצלמה חיצונית באמצעות סריקת קוד QR.

source: How to Use
he: איך להשתמש

# step1
source: Connect your cameras or ensure they are active.
he: חבר את המצלמות או וודא שהן פעילות.

# step2
source: Select a camera source from the list on the left.
he: בחר מקור מצלמה מהרשימה בצד שמאל.

# step3
source: Use the sidebar in the camera view to apply filters like "Whiteboard" for better contrast.
he: השתמש בסרגל הצד במסך המצלמה כדי להפעיל מסננים כמו "לוח לבן" לניגודיות טובה יותר.

# step4
source: Take snapshots using the shutter button. They appear in the gallery.
he: צלם תמונות באמצעות כפתור הצילום. הן יופיעו בגלריה.

# step5
source: Go to the home screen to review your gallery and export to PDF.
he: חזור למסך הבית כדי לעבור על הגלריה ולייצא ל-PDF.

# visitGithub
source: Visit GitHub Repository
he: בקר בגיטהאב

# madeWithLove
source: Made with ❤️ by the Kaptchi Team
he: נבנה באהבה על ידי צוות Kaptchi

# aboutTooltip
source: About
he: אודות

# ipSelectionTooltip
source: Select the IP address of your Wi-Fi or Local Network connection. Usually starts with 192.168.x.x or 10.x.x.x. Ensure your phone is on the same network.
he: בחר את כתובת ה-IP של חיבור ה-Wi-Fi או הרשת המקומית שלך. בדרך כלל מתחיל ב-192.168.x.x או 10.x.x.x. וודא שהטלפון מחובר לאותה רשת.

source: Screen Capture
he: לכידת מסך

# captureMonitor
source: Capture {monitorName}
he: לכוד {monitorName}

source: Capture Window...
he: לכוד חלון...

source: Select Window to Capture
he: בחר חלון ללכידה

source: Failed to start screen capture
he: נכשל בהפעלת לכידת מסך

source: Could not open link
he: לא ניתן לפתוח קישור
